Repository: Infotekkers/EFPL
Catalog: flutter-user-client/lib/locale/app_*.arb
Languages: am

# language
source: English
am: Amharic

source: Sign Up
am: ይመዝገቡ

source: Sign In
am: ግባ

source: Already have an account
am: መለያ አለህ

source: Authentication
am: ማረጋገጫ

source: login
am: ግባ

# appSloganMain
source: A new way to enjoy the EPL.
am: EFLን ማጣጣሚያ አዲስ መንገድ።

# appSloganSub
source: Join our community
am: ዛሬዉኑ ይቀላቀሉን።

source: Forgot Password ?
am: ይለፉቃሎን ረሱ ?

source: Don't have an account ?
am: መለያ የሎትም ?

source: Reset Password
am: ይለፉቃሎን መለወጥ

# resetInfoLine
source: Input your email so we can send reset your password
am: ይለፉቃሎን ለመለወጥ ኢሜይልዋን ያሰገቡ።

source: Email
am: ኢሜይል

source: User Name
am: የተጠቃሚ ስም

source: Team Name
am: የቡድን ስም

source: Password
am: ይለፉቃ

source: Confirm Password
am: ይለፉቃ አረጋግጥ

source: Team
am: ቡድን

source: Transfers
am: ማስተላለፍያ

source: Transfer
am: ለውጥ

source: Cancel Transfer
am: ለውጥ ሰርዝ

source: Fixtures
am: መርሐግብር

source: League
am: ሊግ

source: Stats
am: ስታትስቲክስ

# currentLanguage
source: Language
am: ቋንቋ

source: GameWeek
am: ሳምንት

# checkConn
source: Check Your Internet Connection
am: የበይነመረብ ግንኙነትዎን ያረጋግጡ

source: Team Saved
am: ቡድኖት ተይዟል

source: Retry
am: እንደገና ይሞክሩ

source: Cancel
am: ሰርዝ

source: Save
am: ያረጋግጡ

# chipConfirmation
source: Chip about to be activated. Confirm?
am: ቺፕ ሊጠቀሙ ነው። ያረጋግጡ?

# playerInfo
source: Player Information
am: የተጫዋች መረጃ

source: Switch Player
am: ተጫዋች ይቀይሩ

source: Make Captain
am: አምበል ያድርጉ

source: Make Vice-captain
am: ምክትል አምበል ያድርጉ

source: GK
am: በረኛ

source: DEF
am: ተከላካይ

source: MID
am: አማካይ

source: ATT
am: አጥቂ

source: Chips
am: ቺፕስ

# tc
source: Triple Captian
am: አምበል አባዥ

# bb
source: Bench Boost
am: ተቀያሪ አስቆጣሪ

# fh
source: Free Hit
am: ነጻ ሳምንት

# wc
source: Wildcard
am: ዛሬ አልቀጣም

source: No Connection
am: ኢንተርኔት የለም

source: Could not contact the server
am: ስርቨርሩን ማግኘት አልተቻለም

source: Please check your connection
am: እባክህ የኢንተርኔት ግንኙነትህን አረጋግጥ

source: Please Login
am: እባክዎ ይግቡ

source: Could not verify
am: ማንነትዎን ማረጋገጥ አልተቻለም

source: Please login and try again
am: እባክዎ ቆየት ብለው ይሞክሩ

source: Something went wrong
am: የሆነ ስህተት ተከስቷል

source: No Team Selected
am: ምንም ቡድን አልተመረጠም

# pleaseSelectYourInitialTeam
source: Please select your initial team! It's on us!
am: እባክዎ የመጀመሪያ ቡድንዎን ይምረጡ

source: Price Limit Exceeded
am: የዋጋ ገደብ አልፏል

source: The team you have selected exceeds the limit
am: የመረጡት ቡድን ከገደቡ አልፏል

source: Players from Team
am: ተጫዋቾች ከአንድ ቡድን

# youHaveSelectedMoreThanPlayersFrom
source: You have selected more than 3 players from
am: ከ 3 በላይ ተጫዋቾችን መርጠዋል

source: Incomplete Team
am: ያልተሟላ ቡድን

source: The Team you have selected is incomplete
am: የመረጥከው ቡድን ያልተሟላ ነው

source: Bank
am: ቀሪ

source: Deduction
am: ተቀናሽ

source: Free Transfers
am: ነጻ ዝውውር

source: Deadline
am: ማለቂያ ሰአት

source: Transfer List
am: ዝውውር ዝርዝር

# selectTeam
source: Select a Team
am: ቡድን ይምረጡ

# availableInjury
source: Available
am: የተጎዳ

# unavailableInjury
source: Unavailable
am: ያልተጎዳ

source: All
am: ሁሉም

# minimumPrice
source: Min
am: ዝቅተኛ

# maximumPrice
source: Max
am: ከፍተኛ

source: Player
am: ተጫዋች

source: Price
am: ዋጋ

source: Points
am: ነጥብ

source: Confirm Transfers
am: ዝውውር ያረጋግጡ

source: Cancel Transfers
am: ዝውውር ሰርዝ

source: These transfers will be active for
am: እነዚህ ዝውውሮች የምድርጉት ለ

source: and
am: እና

source: no points
am: ምንም ነጥብ

# noWillBeDeductedFromYourScore
source: will be deducted from your score.
am: አይቀንስም

source: will be deducted from your score.
am: ተቀናሽ ይደረጋል

source: Wildcard already played
am: Wildcard አስቀድሞ ተጫውቷል

source: Play WildCard
am: Wildcard አጫውት

source: Free Hit Already Played
am: ነፃ ሂት አስቀድሞ ተጫውቷል

source: Play Free Hit
am: ነፃ ምታ ይጫወቱ

source: No Fixtures
am: ጨዋታዎች የሉም

source: Player Information
am: የተጫዋች መረጃ

source: Upcoming Fixtures
am: መጪ ጨዋታዎች

source: Statistic
am: ስታትስቲክስ

source: Value
am: ተመን

source: Pts
am: ነጥብ

source: Minutes Played
am: የተጫዉተዉ ደቂቃ

source: Goals
am: ግቦች

source: Assists
am: አመቻችቶ ያቀበለዉ

source: Yellows
am: ቢጫዎች

# reds
source: Red
am: ቀይ

source: Penalty Missed
am: የተሳቱ ፍጹም ቅጣት ምቾቻ

source: Own Goal
am: የራስ ግብ

source: Saves
am: ያዳነዉ

source: Penalty Saved
am: ያዳነዉ ፍጹም ቅጣት ምቾቻ

source: Clean Sheet
am: ምንም ግቦች

# sum
source: Total Sum
am: ጠቅላላ ድምር

source: Your Watch List
am: የምኞት ዝርዝር

source: Add To WatchList
am: የምኞት ዝርዝር ውስጥ ያስገቡ

source: Remove From WatchList
am: ከምኞት ዝርዝር አስወግድ

source: Summary
am: ማጠቃለያ

source: Most
am: ከፍተኛ

source: Clean Sheets
am: ከ ግብ ነፃ

source: Select a Team
am: ቡድን ይምረጡ

source: Standings
am: ደረጃ

source: Pos
am: ቦታ

source: Club
am: ቡድን

source: P
am: የተ

source: W
am: አሸ

source: d
am: አቻ

source: L
am: ሽን

source: GD
am: ጎ.ል

source: January
am: ጃንዋሪ

source: February
am: ፌቡራሪ

source: March
am: ማርች

source: April
am: አፕሪል

source: May
am: ሜይ

source: June
am: ጁን

source: July
am: ጁላይ

source: August
am: ኦገሰት

source: September
am: ሴፕቴምበር

source: October
am: ኦክቶበር

source: November
am: ኖቬምበር

source: December
am: ዲሴምበር

source: Addis Ababa
am: አዲስ አበባ

source: Wolaita Sodo
am: ወላይታ ሶዶ

source: Hawassa
am: ሀዋሳ

source: Gondar
am: ጎንደር

source: Adama
am: አዳማ

source: Sidama
am: ሲዳማ

source: Bahir Dar
am: ባህር ዳር

source: Wolkite
am: ወልቂጤ

source: Arba Minch
am: አርባምንጭ

source: Hosaena
am: ሆሣዕና

source: Dire Dawa
am: ድሬዳዋ

source: Jimma
am: ጅማ

source: Sebeta
am: ሰበታ

source: Sebeta Stadium
am: ሰበታ ስታዲየም

source: Jimma Stadium
am: ጅማ ስታዲየም

source: Addis Ababa Stadium
am: አዲስ አበባ ስታዲየም

source: Dire Dawa Stadium
am: ድሬዳዋ ስታዲየም

source: Abiy Hersamo Stadium
am: አብይ ሄርሳሞ ስታዲየም

source: Arba Minch Stadium
am: አርባ ምንጭ ስታዲየም

source: Wolkite Stadium
am: ወልቂጤ ስታዲየም

source: Bahir Dar Stadium
am: የባህር ዳር ስታዲየም

source: Hawasa Metropolitan Stadium
am: የሀዋሳ ሜትሮፖሊታን ስታዲየም

source: Abebe Bikila Stadium
am: አበበ ቢቂላ ስታዲየም

source: Fasiledes Stadium
am: ፋሲለደስ ስታዲየም

source: Awassa Kenema Stadium
am: አዋሳ ከነማ ስታዲየም

source: Wolaita Sodo Stadium
am: ወላይታ ሶዶ ስታዲየም

source: Line Ups
am: አሰላለፍ

source: Events
am: ክስተቶች
